app/Controllers/Proyectos.php

     public function detalles($projectId)
    {
        $session = session();
        if (!$session->get('is_logged_in')) {
            return redirect()->to('/login');
        }

        $defaults = ['default_theme' => 'dark'];
        $settings = $session->get('general_settings') ?? $defaults;
        helper('url');

        $db = Database::connect();

        // --- 1. OBTENER DATOS PRINCIPALES DEL PROYECTO ---
        $proyectoInfo = $db->table('dbo.proyectos p')
            ->select('p.id_proyecto, p.nombre, p.descripcion, p.status, p.fecha_inicio, p.fecha_fin, u.Nombre, u.Apellido_Paterno')
            ->join('dbo.usuario u', 'u.Id_usuario = p.id_usuario_asignado', 'left')
            ->where('p.id_proyecto', $projectId)
            ->get()
            ->getRowArray();

        if (!$proyectoInfo) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // --- 2. OBTENER ESTADÍSTICAS ---
        $total_tareas = $db->table('dbo.TAREAS')->where('PROY_ID', $projectId)->countAllResults();
        $tareas_completadas = $db->table('dbo.TAREAS t')->join('dbo.ESTATUS e', 't.STAT_ID = e.STAT_ID')->where('t.PROY_ID', $projectId)->where('e.STAT_NOM', 'Completado')->countAllResults();
        $costo = $db->table('dbo.DET_COSTOS')->selectSum('COST_MONTO', 'costo_total')->where('PROY_ID', $projectId)->get()->getRow();
---
SELECT "p"."id_proyecto", "p"."nombre", "p"."descripcion", "p"."status", "p"."fecha_inicio", "p"."fecha_fin", "u"."Nombre", "u"."Apellido_Paterno"
FROM "pruebas"."dbo"."proyectos" "p"
LEFT JOIN "pruebas"."dbo"."usuario" "u" ON "u"."Id_usuario" = "p"."id_usuario_asignado"
WHERE "p"."id_proyecto" = '2'
SELECT COUNT(*) AS "numrows"
FROM "pruebas"."dbo"."TAREAS"
WHERE "PROY_ID" = '1'
SELECT COUNT(*) AS "numrows"
FROM "pruebas"."dbo"."TAREAS" "t"
JOIN "pruebas"."dbo"."ESTATUS" "e" ON "t"."STAT_ID" = "e"."STAT_ID"
WHERE "t"."PROY_ID" = '1'
AND "e"."STAT_NOM" = 'Completado'
SELECT SUM("COST_MONTO") AS "costo_total"
FROM "pruebas"."dbo"."DET_COSTOS"
WHERE "PROY_ID" = '1'


        // --- 3. OBTENER PARTICIPANTES Y GRUPOS ---
        // CORRECCIÓN FINAL: Se usa ->distinct() por separado de ->select()
        $usuarios = $db->table('dbo.DET_GRUPOS dg')
            ->distinct()
            ->select("(u.Nombre + ' ' + u.Apellido_Paterno) as nombre_completo")
            ->join('dbo.usuario u', 'dg.USU_ID = u.Id_usuario')
            ->where('dg.PROY_ID', $projectId)
            ->get()
            ->getResultArray();

        // CORRECCIÓN FINAL: Se usa ->distinct() por separado de ->select()
        $grupos = $db->table('dbo.DET_GRUPOS dg')
            ->distinct()
            ->select('g.GPO_NOM')
            ->join('dbo.GRUPOS g', 'dg.GPO_ID = g.GPO_ID')
            ->where('dg.PROY_ID', $projectId)
            ->get()
            ->getResultArray();

        // --- 4. OBTENER TAREAS RECIENTES ---
        $tareas = $db->table('dbo.TAREAS t')->select('t.TAR_NOM, e.STAT_NOM')->join('dbo.ESTATUS e', 't.STAT_ID = e.STAT_ID', 'left')->where('t.PROY_ID', $projectId)->orderBy('t.TAR_FECHAINI', 'DESC')->limit(5)->get()->getResultArray();
---
SELECT DISTINCT (u.Nombre + ' ' + u.Apellido_Paterno) as nombre_completo
FROM "pruebas"."dbo"."DET_GRUPOS" "dg"
JOIN "pruebas"."dbo"."usuario" "u" ON "dg"."USU_ID" = "u"."Id_usuario"
WHERE "dg"."PROY_ID" = '2'
SELECT DISTINCT "g"."GPO_NOM"
FROM "pruebas"."dbo"."DET_GRUPOS" "dg"
JOIN "pruebas"."dbo"."GRUPOS" "g" ON "dg"."GPO_ID" = "g"."GPO_ID"
WHERE "dg"."PROY_ID" = '2'
SELECT "t"."TAR_NOM", "e"."STAT_NOM"
FROM "pruebas"."dbo"."TAREAS" "t"
LEFT JOIN "pruebas"."dbo"."ESTATUS" "e" ON "t"."STAT_ID" = "e"."STAT_ID"
WHERE "t"."PROY_ID" = '1'
ORDER BY "t"."TAR_FECHAINI" DESC
 OFFSET 0  ROWS FETCH NEXT 5 ROWS ONLY